stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u366xx.h
/********************  Bit definition for RCC_ICSCR1 register  ***************/
#define RCC_ICSCR1_MSICAL1_Pos              (0U)
#define RCC_ICSCR1_MSICAL1_Msk              (0x3FUL << RCC_ICSCR1_MSICAL1_Pos)      /*!< 0x0000003F */
#define RCC_ICSCR1_MSICAL1                  RCC_ICSCR1_MSICAL1_Msk                  /*!< MSICAL1[5:0] bits: MSIRC1 clock Calibration */
#define RCC_ICSCR1_MSICAL1_0                (0x01UL << RCC_ICSCR1_MSICAL1_Pos)      /*!< 0x00000001 */
#define RCC_ICSCR1_MSICAL1_1                (0x02UL << RCC_ICSCR1_MSICAL1_Pos)      /*!< 0x00000002 */
#define RCC_ICSCR1_MSICAL1_2                (0x04UL << RCC_ICSCR1_MSICAL1_Pos)      /*!< 0x00000004 */
#define RCC_ICSCR1_MSICAL1_3                (0x08UL << RCC_ICSCR1_MSICAL1_Pos)      /*!< 0x00000008 */
#define RCC_ICSCR1_MSICAL1_4                (0x10UL << RCC_ICSCR1_MSICAL1_Pos)      /*!< 0x00000010 */
#define RCC_ICSCR1_MSICAL1_5                (0x20UL << RCC_ICSCR1_MSICAL1_Pos)      /*!< 0x00000020 */
#define RCC_ICSCR1_MSICAL0_Pos              (6U)
#define RCC_ICSCR1_MSICAL0_Msk              (0x3FUL << RCC_ICSCR1_MSICAL0_Pos)      /*!< 0x00000FC0 */
#define RCC_ICSCR1_MSICAL0                  RCC_ICSCR1_MSICAL0_Msk                  /*!< MSICAL0[5:0] bits: MSIRC0 clock Calibration */
#define RCC_ICSCR1_MSICAL0_0                (0x01UL << RCC_ICSCR1_MSICAL0_Pos)      /*!< 0x00000040 */
#define RCC_ICSCR1_MSICAL0_1                (0x02UL << RCC_ICSCR1_MSICAL0_Pos)      /*!< 0x00000080 */
#define RCC_ICSCR1_MSICAL0_2                (0x04UL << RCC_ICSCR1_MSICAL0_Pos)      /*!< 0x00000100 */
#define RCC_ICSCR1_MSICAL0_3                (0x08UL << RCC_ICSCR1_MSICAL0_Pos)      /*!< 0x00000200 */
#define RCC_ICSCR1_MSICAL0_4                (0x10UL << RCC_ICSCR1_MSICAL0_Pos)      /*!< 0x00000400 */
#define RCC_ICSCR1_MSICAL0_5                (0x20UL << RCC_ICSCR1_MSICAL0_Pos)      /*!< 0x00000800 */
#define RCC_ICSCR1_MSIHSINDIV_Pos           (19U)
#define RCC_ICSCR1_MSIHSINDIV_Msk           (0x1UL << RCC_ICSCR1_MSIHSINDIV_Pos)    /*!< 0x00080000 */
#define RCC_ICSCR1_MSIHSINDIV               RCC_ICSCR1_MSIHSINDIV_Msk               /*!< MSIRCx PLL-mode HSE input fast clock Division */
#define RCC_ICSCR1_MSIPLL1SEL_Pos           (20U)
#define RCC_ICSCR1_MSIPLL1SEL_Msk           (0x1UL << RCC_ICSCR1_MSIPLL1SEL_Pos)    /*!< 0x00100000 */
#define RCC_ICSCR1_MSIPLL1SEL               RCC_ICSCR1_MSIPLL1SEL_Msk               /*!< MSIRC1 PLL-mode input clock Selection */
#define RCC_ICSCR1_MSIPLL0SEL_Pos           (21U)
#define RCC_ICSCR1_MSIPLL0SEL_Msk           (0x1UL << RCC_ICSCR1_MSIPLL0SEL_Pos)    /*!< 0x00200000 */
#define RCC_ICSCR1_MSIPLL0SEL               RCC_ICSCR1_MSIPLL0SEL_Msk               /*!< MSIRC0 PLL-mode input clock Selection */
#define RCC_ICSCR1_MSIBIAS_Pos              (22U)
#define RCC_ICSCR1_MSIBIAS_Msk              (0x1UL << RCC_ICSCR1_MSIBIAS_Pos)       /*!< 0x00400000 */
#define RCC_ICSCR1_MSIBIAS                  RCC_ICSCR1_MSIBIAS_Msk                  /*!< MSI BIAS mode selection */
#define RCC_ICSCR1_MSIRGSEL_Pos             (23U)
#define RCC_ICSCR1_MSIRGSEL_Msk             (0x1UL << RCC_ICSCR1_MSIRGSEL_Pos)      /*!< 0x00800000 */
#define RCC_ICSCR1_MSIRGSEL                 RCC_ICSCR1_MSIRGSEL_Msk                 /*!< MSI clock range selection */
#define RCC_ICSCR1_MSIPLL1N_Pos             (24U)
#define RCC_ICSCR1_MSIPLL1N_Msk             (0x3UL << RCC_ICSCR1_MSIPLL1N_Pos)      /*!< 0x03000000 */
#define RCC_ICSCR1_MSIPLL1N                 RCC_ICSCR1_MSIPLL1N_Msk                 /*!< MSIPLL1N[1:0] bits: MSIRC1 frequency selection in PLL-mode */
#define RCC_ICSCR1_MSIPLL1N_0               (0x1UL << RCC_ICSCR1_MSIPLL1N_Pos)      /*!< 0x01000000 */
#define RCC_ICSCR1_MSIPLL1N_1               (0x2UL << RCC_ICSCR1_MSIPLL1N_Pos)      /*!< 0x02000000 */
#define RCC_ICSCR1_MSIKDIV_Pos              (26U)
#define RCC_ICSCR1_MSIKDIV_Msk              (0x3UL << RCC_ICSCR1_MSIKDIV_Pos)       /*!< 0x0C000000 */
#define RCC_ICSCR1_MSIKDIV                  RCC_ICSCR1_MSIKDIV_Msk                  /*!< MSIK Oscillator division */
#define RCC_ICSCR1_MSIKDIV_0                (0x1UL << RCC_ICSCR1_MSIKDIV_Pos)       /*!< 0x04000000 */
#define RCC_ICSCR1_MSIKDIV_1                (0x2UL << RCC_ICSCR1_MSIKDIV_Pos)       /*!< 0x08000000 */
#define RCC_ICSCR1_MSIKSEL_Pos              (28U)
#define RCC_ICSCR1_MSIKSEL_Msk              (0x1UL << RCC_ICSCR1_MSIKSEL_Pos)       /*!< 0x10000000 */
#define RCC_ICSCR1_MSIKSEL                  RCC_ICSCR1_MSIKSEL_Msk                  /*!< MSIK clock source selection */
#define RCC_ICSCR1_MSISDIV_Pos              (29U)
#define RCC_ICSCR1_MSISDIV_Msk              (0x3UL << RCC_ICSCR1_MSISDIV_Pos)       /*!< 0x60000000 */
#define RCC_ICSCR1_MSISDIV                  RCC_ICSCR1_MSISDIV_Msk                  /*!< MSIS Oscillator division */
#define RCC_ICSCR1_MSISDIV_0                (0x1UL << RCC_ICSCR1_MSISDIV_Pos)       /*!< 0x20000000 */
#define RCC_ICSCR1_MSISDIV_1                (0x2UL << RCC_ICSCR1_MSISDIV_Pos)       /*!< 0x40000000 */
#define RCC_ICSCR1_MSISSEL_Pos              (31U)
#define RCC_ICSCR1_MSISSEL_Msk              (0x1UL << RCC_ICSCR1_MSISSEL_Pos)       /*!< 0x80000000 */
#define RCC_ICSCR1_MSISSEL                  RCC_ICSCR1_MSISSEL_Msk                  /*!< MSIS clock source selection */

/********************  Bit definition for RCC_ICSCR2 register  ***************/
#define RCC_ICSCR2_MSITRIM1_Pos             (0U)
#define RCC_ICSCR2_MSITRIM1_Msk             (0x3FUL << RCC_ICSCR2_MSITRIM1_Pos)     /*!< 0x0000003F */
#define RCC_ICSCR2_MSITRIM1                 RCC_ICSCR2_MSITRIM1_Msk                 /*!< MSITRIM1[5:0] bits: MSIRC1 clock trimming */
#define RCC_ICSCR2_MSITRIM1_0               (0x01UL << RCC_ICSCR2_MSITRIM1_Pos)     /*!< 0x00000001 */
#define RCC_ICSCR2_MSITRIM1_1               (0x02UL << RCC_ICSCR2_MSITRIM1_Pos)     /*!< 0x00000002 */
#define RCC_ICSCR2_MSITRIM1_2               (0x04UL << RCC_ICSCR2_MSITRIM1_Pos)     /*!< 0x00000004 */
#define RCC_ICSCR2_MSITRIM1_3               (0x08UL << RCC_ICSCR2_MSITRIM1_Pos)     /*!< 0x00000008 */
#define RCC_ICSCR2_MSITRIM1_4               (0x10UL << RCC_ICSCR2_MSITRIM1_Pos)     /*!< 0x00000010 */
#define RCC_ICSCR2_MSITRIM1_5               (0x20UL << RCC_ICSCR2_MSITRIM1_Pos)     /*!< 0x00000020 */
#define RCC_ICSCR2_MSITRIM0_Pos             (6U)
#define RCC_ICSCR2_MSITRIM0_Msk             (0x3FUL << RCC_ICSCR2_MSITRIM0_Pos)     /*!< 0x00000FC0 */
#define RCC_ICSCR2_MSITRIM0                 RCC_ICSCR2_MSITRIM0_Msk                 /*!< MSITRIM0[5:0] bits: MSIRC0 clock trimming */
#define RCC_ICSCR2_MSITRIM0_0               (0x01UL << RCC_ICSCR2_MSITRIM0_Pos)     /*!< 0x00000040 */
#define RCC_ICSCR2_MSITRIM0_1               (0x02UL << RCC_ICSCR2_MSITRIM0_Pos)     /*!< 0x00000080 */
#define RCC_ICSCR2_MSITRIM0_2               (0x04UL << RCC_ICSCR2_MSITRIM0_Pos)     /*!< 0x00000100 */
#define RCC_ICSCR2_MSITRIM0_3               (0x08UL << RCC_ICSCR2_MSITRIM0_Pos)     /*!< 0x00000200 */
#define RCC_ICSCR2_MSITRIM0_4               (0x10UL << RCC_ICSCR2_MSITRIM0_Pos)     /*!< 0x00000400 */
#define RCC_ICSCR2_MSITRIM0_5               (0x20UL << RCC_ICSCR2_MSITRIM0_Pos)     /*!< 0x00000800 */

/********************  Bit definition for RCC_ICSCR3 register  ***************/
#define RCC_ICSCR3_HSICAL_Pos               (0U)
#define RCC_ICSCR3_HSICAL_Msk               (0xFFFUL << RCC_ICSCR3_HSICAL_Pos)    /*!< 0x00000FFF */
#define RCC_ICSCR3_HSICAL                   RCC_ICSCR3_HSICAL_Msk                 /*!< HSICAL[11:0] bits: HSI clock calibration */
#define RCC_ICSCR3_HSICAL_0                 (0x001UL << RCC_ICSCR3_HSICAL_Pos)    /*!< 0x00000001 */
#define RCC_ICSCR3_HSICAL_1                 (0x002UL << RCC_ICSCR3_HSICAL_Pos)    /*!< 0x00000002 */
#define RCC_ICSCR3_HSICAL_2                 (0x004UL << RCC_ICSCR3_HSICAL_Pos)    /*!< 0x00000004 */
#define RCC_ICSCR3_HSICAL_3                 (0x008UL << RCC_ICSCR3_HSICAL_Pos)    /*!< 0x00000008 */
#define RCC_ICSCR3_HSICAL_4                 (0x010UL << RCC_ICSCR3_HSICAL_Pos)    /*!< 0x00000010 */
#define RCC_ICSCR3_HSICAL_5                 (0x020UL << RCC_ICSCR3_HSICAL_Pos)    /*!< 0x00000020 */
#define RCC_ICSCR3_HSICAL_6                 (0x040UL << RCC_ICSCR3_HSICAL_Pos)    /*!< 0x00000040 */
#define RCC_ICSCR3_HSICAL_7                 (0x080UL << RCC_ICSCR3_HSICAL_Pos)    /*!< 0x00000080 */
#define RCC_ICSCR3_HSICAL_8                 (0x100UL << RCC_ICSCR3_HSICAL_Pos)    /*!< 0x00000100 */
#define RCC_ICSCR3_HSICAL_9                 (0x200UL << RCC_ICSCR3_HSICAL_Pos)    /*!< 0x00000200 */
#define RCC_ICSCR3_HSICAL_10                (0x400UL << RCC_ICSCR3_HSICAL_Pos)    /*!< 0x00000400 */
#define RCC_ICSCR3_HSICAL_11                (0x800UL << RCC_ICSCR3_HSICAL_Pos)    /*!< 0x00000800 */
#define RCC_ICSCR3_HSITRIM_Pos              (16U)
#define RCC_ICSCR3_HSITRIM_Msk              (0x1FUL << RCC_ICSCR3_HSITRIM_Pos)    /*!< 0x001F0000 */
#define RCC_ICSCR3_HSITRIM                  RCC_ICSCR3_HSITRIM_Msk                /*!< HSITRIM[4:0] bits: HSI clock trimming */
#define RCC_ICSCR3_HSITRIM_0                (0x01UL << RCC_ICSCR3_HSITRIM_Pos)    /*!< 0x00010000 */
#define RCC_ICSCR3_HSITRIM_1                (0x02UL << RCC_ICSCR3_HSITRIM_Pos)    /*!< 0x00020000 */
#define RCC_ICSCR3_HSITRIM_2                (0x04UL << RCC_ICSCR3_HSITRIM_Pos)    /*!< 0x00040000 */
#define RCC_ICSCR3_HSITRIM_3                (0x08UL << RCC_ICSCR3_HSITRIM_Pos)    /*!< 0x00080000 */
#define RCC_ICSCR3_HSITRIM_4                (0x10UL << RCC_ICSCR3_HSITRIM_Pos)    /*!< 0x00100000 */

/********************  Bit definition for RCC_CRRCR register  *****************/
#define RCC_CRRCR_HSI48CAL_Pos              (0U)
#define RCC_CRRCR_HSI48CAL_Msk              (0x1FFUL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x000001FF */
#define RCC_CRRCR_HSI48CAL                  RCC_CRRCR_HSI48CAL_Msk                  /*!< HSI48CAL[8:0] bits: HSI48 Clock Calibration */
#define RCC_CRRCR_HSI48CAL_0                (0x001UL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x00000001 */
#define RCC_CRRCR_HSI48CAL_1                (0x002UL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x00000002 */
#define RCC_CRRCR_HSI48CAL_2                (0x004UL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x00000004 */
#define RCC_CRRCR_HSI48CAL_3                (0x008UL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x00000008 */
#define RCC_CRRCR_HSI48CAL_4                (0x010UL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x00000010 */
#define RCC_CRRCR_HSI48CAL_5                (0x020UL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x00000020 */
#define RCC_CRRCR_HSI48CAL_6                (0x040UL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x00000040 */
#define RCC_CRRCR_HSI48CAL_7                (0x080UL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x00000080 */
#define RCC_CRRCR_HSI48CAL_8                (0x100UL << RCC_CRRCR_HSI48CAL_Pos)     /*!< 0x00000100 */

/********************  Bit definition for RCC_CFGR1 register  ******************/
#define RCC_CFGR1_SW_Pos                    (0U)
#define RCC_CFGR1_SW_Msk                    (0x3UL << RCC_CFGR1_SW_Pos)             /*!< 0x00000003 */
#define RCC_CFGR1_SW                        RCC_CFGR1_SW_Msk                        /*!< SW[1:0] bits : System clock Switch */
#define RCC_CFGR1_SW_0                      (0x1UL << RCC_CFGR1_SW_Pos)             /*!< 0x00000001 */
#define RCC_CFGR1_SW_1                      (0x2UL << RCC_CFGR1_SW_Pos)             /*!< 0x00000002 */
#define RCC_CFGR1_SWS_Pos                   (2U)
#define RCC_CFGR1_SWS_Msk                   (0x3UL << RCC_CFGR1_SWS_Pos)            /*!< 0x0000000C */
#define RCC_CFGR1_SWS                       RCC_CFGR1_SWS_Msk                       /*!< SWS[1:0] bits : System Clock Switch Status */
#define RCC_CFGR1_SWS_0                     (0x1UL << RCC_CFGR1_SWS_Pos)            /*!< 0x00000004 */
#define RCC_CFGR1_SWS_1                     (0x2UL << RCC_CFGR1_SWS_Pos)            /*!< 0x00000008 */
#define RCC_CFGR1_STOPWUCK_Pos              (4U)
#define RCC_CFGR1_STOPWUCK_Msk              (0x1UL << RCC_CFGR1_STOPWUCK_Pos)       /*!< 0x00000010 */
#define RCC_CFGR1_STOPWUCK                  RCC_CFGR1_STOPWUCK_Msk                  /*!< Wake Up from stop and CSS backup clock selection */
#define RCC_CFGR1_STOPKERWUCK_Pos           (5U)
#define RCC_CFGR1_STOPKERWUCK_Msk           (0x1UL << RCC_CFGR1_STOPKERWUCK_Pos)    /*!< 0x00000020 */
#define RCC_CFGR1_STOPKERWUCK               RCC_CFGR1_STOPKERWUCK_Msk               /*!< Wakeup from Stop kernel clock automatic enable selection */
#define RCC_CFGR1_MCO2SEL_Pos               (16U)
#define RCC_CFGR1_MCO2SEL_Msk               (0xFUL << RCC_CFGR1_MCO2SEL_Pos)       /*!< 0x000F0000 */
#define RCC_CFGR1_MCO2SEL                   RCC_CFGR1_MCO2SEL_Msk                  /*!< MCO2SEL [3:0] bits : Microcontroller Clock Output 2 (MCO2) Selection */
#define RCC_CFGR1_MCO2SEL_0                 (0x1UL << RCC_CFGR1_MCO2SEL_Pos)       /*!< 0x00010000 */
#define RCC_CFGR1_MCO2SEL_1                 (0x2UL << RCC_CFGR1_MCO2SEL_Pos)       /*!< 0x00020000 */
#define RCC_CFGR1_MCO2SEL_2                 (0x4UL << RCC_CFGR1_MCO2SEL_Pos)       /*!< 0x00040000 */
#define RCC_CFGR1_MCO2SEL_3                 (0x8UL << RCC_CFGR1_MCO2SEL_Pos)       /*!< 0x00080000 */
#define RCC_CFGR1_MCO2PRE_Pos               (20U)
#define RCC_CFGR1_MCO2PRE_Msk               (0x7UL << RCC_CFGR1_MCO2PRE_Pos)       /*!< 0x00700000 */
#define RCC_CFGR1_MCO2PRE                   RCC_CFGR1_MCO2PRE_Msk                  /*!< MCO2PRE [2:0] bits : Microcontroller Clock Output 2 (MCO2) Prescaler */
#define RCC_CFGR1_MCO2PRE_0                 (0x1UL << RCC_CFGR1_MCO2PRE_Pos)       /*!< 0x00100000 */
#define RCC_CFGR1_MCO2PRE_1                 (0x2UL << RCC_CFGR1_MCO2PRE_Pos)       /*!< 0x00200000 */
#define RCC_CFGR1_MCO2PRE_2                 (0x4UL << RCC_CFGR1_MCO2PRE_Pos)       /*!< 0x00400000 */
#define RCC_CFGR1_MCOSEL_Pos                (24U)
#define RCC_CFGR1_MCOSEL_Msk                (0xFUL << RCC_CFGR1_MCOSEL_Pos)        /*!< 0x0F000000 */
#define RCC_CFGR1_MCOSEL                    RCC_CFGR1_MCOSEL_Msk                   /*!< MCOSEL [3:0] bits : Microcontroller Clock Output (MCO) Selection */
#define RCC_CFGR1_MCOSEL_0                  (0x1UL << RCC_CFGR1_MCOSEL_Pos)        /*!< 0x01000000 */
#define RCC_CFGR1_MCOSEL_1                  (0x2UL << RCC_CFGR1_MCOSEL_Pos)        /*!< 0x02000000 */
#define RCC_CFGR1_MCOSEL_2                  (0x4UL << RCC_CFGR1_MCOSEL_Pos)        /*!< 0x04000000 */
#define RCC_CFGR1_MCOSEL_3                  (0x8UL << RCC_CFGR1_MCOSEL_Pos)        /*!< 0x08000000 */
#define RCC_CFGR1_MCOPRE_Pos                (28U)
#define RCC_CFGR1_MCOPRE_Msk                (0x7UL << RCC_CFGR1_MCOPRE_Pos)        /*!< 0x70000000 */
#define RCC_CFGR1_MCOPRE                    RCC_CFGR1_MCOPRE_Msk                   /*!< MCOPRE [2:0] bits : Microcontroller Clock Output (MCO) Prescaler */
#define RCC_CFGR1_MCOPRE_0                  (0x1UL << RCC_CFGR1_MCOPRE_Pos)        /*!< 0x10000000 */
#define RCC_CFGR1_MCOPRE_1                  (0x2UL << RCC_CFGR1_MCOPRE_Pos)        /*!< 0x20000000 */
#define RCC_CFGR1_MCOPRE_2                  (0x4UL << RCC_CFGR1_MCOPRE_Pos)        /*!< 0x40000000 */

