stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u366xx.h
/********************  Bit definition for RCC_AHB1ENR2 register  **************/
#define RCC_AHB1ENR2_PWREN_Pos              (2U)
#define RCC_AHB1ENR2_PWREN_Msk              (0x1UL << RCC_AHB1ENR2_PWREN_Pos)         /*!< 0x00000004 */
#define RCC_AHB1ENR2_PWREN                  RCC_AHB1ENR2_PWREN_Msk                    /*!< PWR Enable */

/********************  Bit definition for RCC_APB1ENR1 register  **************/
#define RCC_APB1ENR1_TIM2EN_Pos             (0U)
#define RCC_APB1ENR1_TIM2EN_Msk             (0x1UL << RCC_APB1ENR1_TIM2EN_Pos)        /*!< 0x00000001 */
#define RCC_APB1ENR1_TIM2EN                 RCC_APB1ENR1_TIM2EN_Msk                   /*!< TIM2 Enable */
#define RCC_APB1ENR1_TIM3EN_Pos             (1U)
#define RCC_APB1ENR1_TIM3EN_Msk             (0x1UL << RCC_APB1ENR1_TIM3EN_Pos)        /*!< 0x00000002 */
#define RCC_APB1ENR1_TIM3EN                 RCC_APB1ENR1_TIM3EN_Msk                   /*!< TIM3 Enable */
#define RCC_APB1ENR1_TIM4EN_Pos             (2U)
#define RCC_APB1ENR1_TIM4EN_Msk             (0x1UL << RCC_APB1ENR1_TIM4EN_Pos)        /*!< 0x00000004 */
#define RCC_APB1ENR1_TIM4EN                 RCC_APB1ENR1_TIM4EN_Msk                   /*!< TIM4 Enable */
#define RCC_APB1ENR1_TIM6EN_Pos             (4U)
#define RCC_APB1ENR1_TIM6EN_Msk             (0x1UL << RCC_APB1ENR1_TIM6EN_Pos)        /*!< 0x00000010 */
#define RCC_APB1ENR1_TIM6EN                 RCC_APB1ENR1_TIM6EN_Msk                   /*!< TIM6 Enable */
#define RCC_APB1ENR1_TIM7EN_Pos             (5U)
#define RCC_APB1ENR1_TIM7EN_Msk             (0x1UL << RCC_APB1ENR1_TIM7EN_Pos)        /*!< 0x00000020 */
#define RCC_APB1ENR1_TIM7EN                 RCC_APB1ENR1_TIM7EN_Msk                   /*!< TIM7 Enable */
#define RCC_APB1ENR1_SPI3EN_Pos             (8U)
#define RCC_APB1ENR1_SPI3EN_Msk             (0x1UL << RCC_APB1ENR1_SPI3EN_Pos)        /*!< 0x00000100 */
#define RCC_APB1ENR1_SPI3EN                 RCC_APB1ENR1_SPI3EN_Msk                   /*!< SPI3 Enable */
#define RCC_APB1ENR1_WWDGEN_Pos             (11U)
#define RCC_APB1ENR1_WWDGEN_Msk             (0x1UL << RCC_APB1ENR1_WWDGEN_Pos)        /*!< 0x00000800 */
#define RCC_APB1ENR1_WWDGEN                 RCC_APB1ENR1_WWDGEN_Msk                   /*!< WWDG Enable */
#define RCC_APB1ENR1_SPI2EN_Pos             (14U)
#define RCC_APB1ENR1_SPI2EN_Msk             (0x1UL << RCC_APB1ENR1_SPI2EN_Pos)        /*!< 0x00004000 */
#define RCC_APB1ENR1_SPI2EN                 RCC_APB1ENR1_SPI2EN_Msk                   /*!< SPI2 Enable */
#define RCC_APB1ENR1_USART3EN_Pos           (18U)
#define RCC_APB1ENR1_USART3EN_Msk           (0x1UL << RCC_APB1ENR1_USART3EN_Pos)      /*!< 0x00040000 */
#define RCC_APB1ENR1_USART3EN               RCC_APB1ENR1_USART3EN_Msk                 /*!< USART3 Enable */
#define RCC_APB1ENR1_UART4EN_Pos            (19U)
#define RCC_APB1ENR1_UART4EN_Msk            (0x1UL << RCC_APB1ENR1_UART4EN_Pos)       /*!< 0x00080000 */
#define RCC_APB1ENR1_UART4EN                RCC_APB1ENR1_UART4EN_Msk                  /*!< UART4 Enable */
#define RCC_APB1ENR1_UART5EN_Pos            (20U)
#define RCC_APB1ENR1_UART5EN_Msk            (0x1UL << RCC_APB1ENR1_UART5EN_Pos)       /*!< 0x00100000 */
#define RCC_APB1ENR1_UART5EN                RCC_APB1ENR1_UART5EN_Msk                  /*!< UART5 Enable */
#define RCC_APB1ENR1_I2C1EN_Pos             (21U)
#define RCC_APB1ENR1_I2C1EN_Msk             (0x1UL << RCC_APB1ENR1_I2C1EN_Pos)        /*!< 0x00200000 */
#define RCC_APB1ENR1_I2C1EN                 RCC_APB1ENR1_I2C1EN_Msk                   /*!< I2C1 Enable */
#define RCC_APB1ENR1_I3C1EN_Pos             (23U)
#define RCC_APB1ENR1_I3C1EN_Msk             (0x1UL << RCC_APB1ENR1_I3C1EN_Pos)        /*!< 0x00800000 */
#define RCC_APB1ENR1_I3C1EN                 RCC_APB1ENR1_I3C1EN_Msk                   /*!< I3C1 Enable */
#define RCC_APB1ENR1_CRSEN_Pos              (24U)
#define RCC_APB1ENR1_CRSEN_Msk              (0x1UL << RCC_APB1ENR1_CRSEN_Pos)         /*!< 0x01000000 */
#define RCC_APB1ENR1_CRSEN                  RCC_APB1ENR1_CRSEN_Msk                    /*!< CRS Enable */
#define RCC_APB1ENR1_OPAMPEN_Pos            (28U)
#define RCC_APB1ENR1_OPAMPEN_Msk            (0x1UL << RCC_APB1ENR1_OPAMPEN_Pos)       /*!< 0x100000000 */
#define RCC_APB1ENR1_OPAMPEN                RCC_APB1ENR1_OPAMPEN_Msk                  /*!< OPAMP Enable */
#define RCC_APB1ENR1_VREFEN_Pos             (29U)
#define RCC_APB1ENR1_VREFEN_Msk             (0x1UL << RCC_APB1ENR1_VREFEN_Pos)        /*!< 0x200000000 */
#define RCC_APB1ENR1_VREFEN                 RCC_APB1ENR1_VREFEN_Msk                   /*!< VREFBUF Enable */
#define RCC_APB1ENR1_RTCAPBEN_Pos           (30U)
#define RCC_APB1ENR1_RTCAPBEN_Msk           (0x1UL << RCC_APB1ENR1_RTCAPBEN_Pos)      /*!< 0x400000000 */
#define RCC_APB1ENR1_RTCAPBEN               RCC_APB1ENR1_RTCAPBEN_Msk                 /*!< RTCAPB Enable */

/********************  Bit definition for RCC_APB1ENR2 register  **************/
#define RCC_APB1ENR2_LPTIM2EN_Pos           (5U)
#define RCC_APB1ENR2_LPTIM2EN_Msk           (0x1UL << RCC_APB1ENR2_LPTIM2EN_Pos)      /*!< 0x00000020 */
#define RCC_APB1ENR2_LPTIM2EN               RCC_APB1ENR2_LPTIM2EN_Msk                 /*!< LPTIM2 Enable */

/********************  Bit definition for RCC_APB2ENR register  **************/
#define RCC_APB2ENR_TIM1EN_Pos              (11U)
#define RCC_APB2ENR_TIM1EN_Msk              (0x1UL << RCC_APB2ENR_TIM1EN_Pos)         /*!< 0x00000800 */
#define RCC_APB2ENR_TIM1EN                  RCC_APB2ENR_TIM1EN_Msk                    /*!< TIM1 Enable */
#define RCC_APB2ENR_SPI1EN_Pos              (12U)
#define RCC_APB2ENR_SPI1EN_Msk              (0x1UL << RCC_APB2ENR_SPI1EN_Pos)         /*!< 0x00001000 */
#define RCC_APB2ENR_SPI1EN                  RCC_APB2ENR_SPI1EN_Msk                    /*!< SPI1 Enable */
#define RCC_APB2ENR_USART1EN_Pos            (14U)
#define RCC_APB2ENR_USART1EN_Msk            (0x1UL << RCC_APB2ENR_USART1EN_Pos)       /*!< 0x00004000 */
#define RCC_APB2ENR_USART1EN                RCC_APB2ENR_USART1EN_Msk                  /*!< USART1 Enable */
#define RCC_APB2ENR_TIM15EN_Pos             (16U)
#define RCC_APB2ENR_TIM15EN_Msk             (0x1UL << RCC_APB2ENR_TIM15EN_Pos)        /*!< 0x00010000 */
#define RCC_APB2ENR_TIM15EN                 RCC_APB2ENR_TIM15EN_Msk                   /*!< TIM15 Enable */
#define RCC_APB2ENR_TIM16EN_Pos             (17U)
#define RCC_APB2ENR_TIM16EN_Msk             (0x1UL << RCC_APB2ENR_TIM16EN_Pos)        /*!< 0x00020000 */
#define RCC_APB2ENR_TIM16EN                 RCC_APB2ENR_TIM16EN_Msk                   /*!< TIM16 Enable */
#define RCC_APB2ENR_TIM17EN_Pos             (18U)
#define RCC_APB2ENR_TIM17EN_Msk             (0x1UL << RCC_APB2ENR_TIM17EN_Pos)        /*!< 0x00040000 */
#define RCC_APB2ENR_TIM17EN                 RCC_APB2ENR_TIM17EN_Msk                   /*!< TIM17 Enable */
#define RCC_APB2ENR_USB1EN_Pos              (24U)
#define RCC_APB2ENR_USB1EN_Msk              (0x1UL << RCC_APB2ENR_USB1EN_Pos)         /*!< 0x01000000 */
#define RCC_APB2ENR_USB1EN                  RCC_APB2ENR_USB1EN_Msk                    /*!< USB1 Enable */

/********************  Bit definition for RCC_APB3ENR register  **************/
#define RCC_APB3ENR_SYSCFGEN_Pos            (1U)
#define RCC_APB3ENR_SYSCFGEN_Msk            (0x1UL << RCC_APB3ENR_SYSCFGEN_Pos)       /*!< 0x00000002 */
#define RCC_APB3ENR_SYSCFGEN                RCC_APB3ENR_SYSCFGEN_Msk                  /*!< SYSCFG Enable */
#define RCC_APB3ENR_LPUART1EN_Pos           (6U)
#define RCC_APB3ENR_LPUART1EN_Msk           (0x1UL << RCC_APB3ENR_LPUART1EN_Pos)      /*!< 0x00000040 */
#define RCC_APB3ENR_LPUART1EN               RCC_APB3ENR_LPUART1EN_Msk                 /*!< LPUART1 Enable */
#define RCC_APB3ENR_I2C3EN_Pos              (7U)
#define RCC_APB3ENR_I2C3EN_Msk              (0x1UL << RCC_APB3ENR_I2C3EN_Pos)         /*!< 0x00000080 */
#define RCC_APB3ENR_I2C3EN                  RCC_APB3ENR_I2C3EN_Msk                    /*!< I2C3 Enable */
#define RCC_APB3ENR_LPTIM1EN_Pos            (11U)
#define RCC_APB3ENR_LPTIM1EN_Msk            (0x1UL << RCC_APB3ENR_LPTIM1EN_Pos)       /*!< 0x00000800 */
#define RCC_APB3ENR_LPTIM1EN                RCC_APB3ENR_LPTIM1EN_Msk                  /*!< LPTIM1 Enable */
#define RCC_APB3ENR_LPTIM3EN_Pos            (12U)
#define RCC_APB3ENR_LPTIM3EN_Msk            (0x1UL << RCC_APB3ENR_LPTIM3EN_Pos)       /*!< 0x00001000 */
#define RCC_APB3ENR_LPTIM3EN                RCC_APB3ENR_LPTIM3EN_Msk                  /*!< LPTIM3 Enable */
#define RCC_APB3ENR_LPTIM4EN_Pos            (13U)
#define RCC_APB3ENR_LPTIM4EN_Msk            (0x1UL << RCC_APB3ENR_LPTIM4EN_Pos)       /*!< 0x00002000 */
#define RCC_APB3ENR_LPTIM4EN                RCC_APB3ENR_LPTIM4EN_Msk                  /*!< LPTIM4 Enable */
#define RCC_APB3ENR_COMPEN_Pos              (15U)
#define RCC_APB3ENR_COMPEN_Msk              (0x1UL << RCC_APB3ENR_COMPEN_Pos)         /*!< 0x00008000 */
#define RCC_APB3ENR_COMPEN                  RCC_APB3ENR_COMPEN_Msk                    /*!< COMP Enable */

/********************  Bit definition for RCC_AHB1SLPENR register  **************/
#define RCC_AHB1SLPENR1_GPDMA1SLPEN_Pos     (0U)
#define RCC_AHB1SLPENR1_GPDMA1SLPEN_Msk     (0x1UL << RCC_AHB1SLPENR1_GPDMA1SLPEN_Pos)     /*!< 0x00000001 */
#define RCC_AHB1SLPENR1_GPDMA1SLPEN         RCC_AHB1SLPENR1_GPDMA1SLPEN_Msk                /*!< GPDMA1 Sleep Mode Enable */
#define RCC_AHB1SLPENR1_FLASHSLPEN_Pos      (8U)
#define RCC_AHB1SLPENR1_FLASHSLPEN_Msk      (0x1UL << RCC_AHB1SLPENR1_FLASHSLPEN_Pos)      /*!< 0x00000100 */
#define RCC_AHB1SLPENR1_FLASHSLPEN          RCC_AHB1SLPENR1_FLASHSLPEN_Msk                 /*!< FLASH Sleep Mode Enable */
#define RCC_AHB1SLPENR1_CRCSLPEN_Pos        (12U)
#define RCC_AHB1SLPENR1_CRCSLPEN_Msk        (0x1UL << RCC_AHB1SLPENR1_CRCSLPEN_Pos)        /*!< 0x00001000 */
#define RCC_AHB1SLPENR1_CRCSLPEN            RCC_AHB1SLPENR1_CRCSLPEN_Msk                   /*!< CRC Sleep Mode Enable */
#define RCC_AHB1SLPENR1_TSCSLPEN_Pos        (16U)
#define RCC_AHB1SLPENR1_TSCSLPEN_Msk        (0x1UL << RCC_AHB1SLPENR1_TSCSLPEN_Pos)        /*!< 0x00010000 */
#define RCC_AHB1SLPENR1_TSCSLPEN            RCC_AHB1SLPENR1_TSCSLPEN_Msk                   /*!< Touch SSLPENsing Controller Sleep Mode Enable */
#define RCC_AHB1SLPENR1_RAMCFGSLPEN_Pos     (17U)
#define RCC_AHB1SLPENR1_RAMCFGSLPEN_Msk     (0x1UL << RCC_AHB1SLPENR1_RAMCFGSLPEN_Pos)     /*!< 0x00020000 */
#define RCC_AHB1SLPENR1_RAMCFGSLPEN         RCC_AHB1SLPENR1_RAMCFGSLPEN_Msk                /*!< RAMCFG Sleep Mode Enable */
#define RCC_AHB1SLPENR1_GTZC1SLPEN_Pos      (24U)
#define RCC_AHB1SLPENR1_GTZC1SLPEN_Msk      (0x1UL << RCC_AHB1SLPENR1_GTZC1SLPEN_Pos)      /*!< 0x00100000 */
#define RCC_AHB1SLPENR1_GTZC1SLPEN          RCC_AHB1SLPENR1_GTZC1SLPEN_Msk                 /*!< GTZC1 Sleep Mode Enable */
#define RCC_AHB1SLPENR1_ICACHESLPEN_Pos     (29U)
#define RCC_AHB1SLPENR1_ICACHESLPEN_Msk     (0x1UL << RCC_AHB1SLPENR1_ICACHESLPEN_Pos)     /*!< 0x20000000 */
#define RCC_AHB1SLPENR1_ICACHESLPEN         RCC_AHB1SLPENR1_ICACHESLPEN_Msk                /*!< ICACHE Sleep Mode Enable */
#define RCC_AHB1SLPENR1_SRAM1SLPEN_Pos      (31U)
#define RCC_AHB1SLPENR1_SRAM1SLPEN_Msk      (0x1UL << RCC_AHB1SLPENR1_SRAM1SLPEN_Pos)      /*!< 0x80000000 */
#define RCC_AHB1SLPENR1_SRAM1SLPEN          RCC_AHB1SLPENR1_SRAM1SLPEN_Msk                 /*!< SRAM1 Sleep Mode Enable */

/********************  Bit definition for RCC_AHB2SLPENR1 register  **************/
#define RCC_AHB2SLPENR1_GPIOASLPEN_Pos      (0U)
#define RCC_AHB2SLPENR1_GPIOASLPEN_Msk      (0x1UL << RCC_AHB2SLPENR1_GPIOASLPEN_Pos)     /*!< 0x00000001 */
#define RCC_AHB2SLPENR1_GPIOASLPEN          RCC_AHB2SLPENR1_GPIOASLPEN_Msk                /*!< IO port A Sleep Mode Enable */
#define RCC_AHB2SLPENR1_GPIOBSLPEN_Pos      (1U)
#define RCC_AHB2SLPENR1_GPIOBSLPEN_Msk      (0x1UL << RCC_AHB2SLPENR1_GPIOBSLPEN_Pos)     /*!< 0x00000002 */
#define RCC_AHB2SLPENR1_GPIOBSLPEN          RCC_AHB2SLPENR1_GPIOBSLPEN_Msk                /*!< IO port B Sleep Mode Enable */
#define RCC_AHB2SLPENR1_GPIOCSLPEN_Pos      (2U)
#define RCC_AHB2SLPENR1_GPIOCSLPEN_Msk      (0x1UL << RCC_AHB2SLPENR1_GPIOCSLPEN_Pos)     /*!< 0x00000004 */
#define RCC_AHB2SLPENR1_GPIOCSLPEN          RCC_AHB2SLPENR1_GPIOCSLPEN_Msk                /*!< IO port C Sleep Mode Enable */
#define RCC_AHB2SLPENR1_GPIODSLPEN_Pos      (3U)
#define RCC_AHB2SLPENR1_GPIODSLPEN_Msk      (0x1UL << RCC_AHB2SLPENR1_GPIODSLPEN_Pos)     /*!< 0x00000008 */
#define RCC_AHB2SLPENR1_GPIODSLPEN          RCC_AHB2SLPENR1_GPIODSLPEN_Msk                /*!< IO port D Sleep Mode Enable */
#define RCC_AHB2SLPENR1_GPIOESLPEN_Pos      (4U)
#define RCC_AHB2SLPENR1_GPIOESLPEN_Msk      (0x1UL << RCC_AHB2SLPENR1_GPIOESLPEN_Pos)     /*!< 0x00000010 */
#define RCC_AHB2SLPENR1_GPIOESLPEN          RCC_AHB2SLPENR1_GPIOESLPEN_Msk                /*!< IO port E Sleep Mode Enable */
#define RCC_AHB2SLPENR1_GPIOGSLPEN_Pos      (6U)
#define RCC_AHB2SLPENR1_GPIOGSLPEN_Msk      (0x1UL << RCC_AHB2SLPENR1_GPIOGSLPEN_Pos)     /*!< 0x00000040 */
#define RCC_AHB2SLPENR1_GPIOGSLPEN          RCC_AHB2SLPENR1_GPIOGSLPEN_Msk                /*!< IO port G Sleep Mode Enable */
#define RCC_AHB2SLPENR1_GPIOHSLPEN_Pos      (7U)
#define RCC_AHB2SLPENR1_GPIOHSLPEN_Msk      (0x1UL << RCC_AHB2SLPENR1_GPIOHSLPEN_Pos)     /*!< 0x00000080 */
#define RCC_AHB2SLPENR1_GPIOHSLPEN          RCC_AHB2SLPENR1_GPIOHSLPEN_Msk                /*!< IO port H Sleep Mode Enable */
#define RCC_AHB2SLPENR1_ADC12SLPEN_Pos      (10U)
#define RCC_AHB2SLPENR1_ADC12SLPEN_Msk      (0x1UL << RCC_AHB2SLPENR1_ADC12SLPEN_Pos)     /*!< 0x00000400 */
#define RCC_AHB2SLPENR1_ADC12SLPEN          RCC_AHB2SLPENR1_ADC12SLPEN_Msk                /*!< ADC12 Sleep Mode Enable */
#define RCC_AHB2SLPENR1_DAC1SLPEN_Pos       (11U)
#define RCC_AHB2SLPENR1_DAC1SLPEN_Msk       (0x1UL << RCC_AHB2SLPENR1_DAC1SLPEN_Pos)      /*!< 0x00000800 */
#define RCC_AHB2SLPENR1_DAC1SLPEN           RCC_AHB2SLPENR1_DAC1SLPEN_Msk                 /*!< DAC1 Sleep Mode Enable */
#define RCC_AHB2SLPENR1_AESSLPEN_Pos        (16U)
#define RCC_AHB2SLPENR1_AESSLPEN_Msk        (0x1UL << RCC_AHB2SLPENR1_AESSLPEN_Pos)       /*!< 0x00010000 */
#define RCC_AHB2SLPENR1_AESSLPEN            RCC_AHB2SLPENR1_AESSLPEN_Msk                  /*!< AES Sleep Mode Enable */
#define RCC_AHB2SLPENR1_HASHSLPEN_Pos       (17U)
#define RCC_AHB2SLPENR1_HASHSLPEN_Msk       (0x1UL << RCC_AHB2SLPENR1_HASHSLPEN_Pos)      /*!< 0x00020000 */
#define RCC_AHB2SLPENR1_HASHSLPEN           RCC_AHB2SLPENR1_HASHSLPEN_Msk                 /*!< HASH Sleep Mode Enable */
#define RCC_AHB2SLPENR1_RNGSLPEN_Pos        (18U)
#define RCC_AHB2SLPENR1_RNGSLPEN_Msk        (0x1UL << RCC_AHB2SLPENR1_RNGSLPEN_Pos)       /*!< 0x00040000 */
#define RCC_AHB2SLPENR1_RNGSLPEN            RCC_AHB2SLPENR1_RNGSLPEN_Msk                  /*!< RNG Sleep Mode Enable */
#define RCC_AHB2SLPENR1_PKASLPEN_Pos        (19U)
#define RCC_AHB2SLPENR1_PKASLPEN_Msk        (0x1UL << RCC_AHB2SLPENR1_PKASLPEN_Pos)       /*!< 0x00080000 */
#define RCC_AHB2SLPENR1_PKASLPEN            RCC_AHB2SLPENR1_PKASLPEN_Msk                  /*!< PKA Sleep Mode Enable */
#define RCC_AHB2SLPENR1_SAESSLPEN_Pos       (20U)
#define RCC_AHB2SLPENR1_SAESSLPEN_Msk       (0x1UL << RCC_AHB2SLPENR1_SAESSLPEN_Pos)      /*!< 0x00100000 */
#define RCC_AHB2SLPENR1_SAESSLPEN           RCC_AHB2SLPENR1_SAESSLPEN_Msk                 /*!< SAES Sleep Mode Enable */
#define RCC_AHB2SLPENR1_CCBSLPEN_Pos        (21U)
#define RCC_AHB2SLPENR1_CCBSLPEN_Msk        (0x1UL << RCC_AHB2SLPENR1_CCBSLPEN_Pos)       /*!< 0x00200000 */
#define RCC_AHB2SLPENR1_CCBSLPEN            RCC_AHB2SLPENR1_CCBSLPEN_Msk                  /*!< CCB Sleep Mode Enable */
#define RCC_AHB2SLPENR1_SRAM2SLPEN_Pos      (30U)
#define RCC_AHB2SLPENR1_SRAM2SLPEN_Msk      (0x1UL << RCC_AHB2SLPENR1_SRAM2SLPEN_Pos)     /*!< 0x40000000 */
#define RCC_AHB2SLPENR1_SRAM2SLPEN          RCC_AHB2SLPENR1_SRAM2SLPEN_Msk                /*!< SRAM2 Sleep Mode Enable */

